In [7]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
from matplotlib import rc
rc('font',family = 'Malgun Gothic')

In [3]:
data = pd.read_csv("./data/Developer Salary.csv", encoding = 'euc-kr',index_col = "일련번호")
data.head()

,나이,학력,성별,정신건강,전문직,개발공부기간,연차,국적,연봉,보유기술개수
일련번호,,,,,,,,,,
DEV1,<35,Master,Man,No,Dev,15,6,Germany,77290,7
DEV2,<35,Undergraduate,Man,No,Dev,9,6,Canada,46135,13
DEV3,>35,Master,Man,No,Dev,26,18,Germany,77831,17
DEV4,>35,Undergraduate,Man,No,Dev,39,21,United Kingdom of Great Britain and Northern I...,68507,3
DEV5,<35,Master,Man,No,Dev,19,10,Germany,60535,5

In [5]:
data.insert(loc = 9, column = "월급" , value = (data[['연봉']]/12*1440).round(1))

In [6]:
data

,나이,학력,성별,정신건강,전문직,개발공부기간,연차,국적,연봉,월급,보유기술개수
일련번호,,,,,,,,,,,
DEV1,<35,Master,Man,No,Dev,15,6,Germany,77290,9274800.0,7
DEV2,<35,Undergraduate,Man,No,Dev,9,6,Canada,46135,5536200.0,13
DEV3,>35,Master,Man,No,Dev,26,18,Germany,77831,9339720.0,17
DEV4,>35,Undergraduate,Man,No,Dev,39,21,United Kingdom of Great Britain and Northern I...,68507,8220840.0,3
DEV5,<35,Master,Man,No,Dev,19,10,Germany,60535,7264200.0,5
...,...,...,...,...,...,...,...,...,...,...,...
DEV33462,<35,Master,Man,Yes,Dev,7,5,United States of America,94000,11280000.0,5
DEV33463,<35,Undergraduate,Man,No,Dev,7,2,Germany,41058,4926960.0,13
DEV33464,>35,Undergraduate,Man,No,Dev,21,16,United States of America,115000,13800000.0,11
DEV33465,<35,Undergraduate,Man,Yes,Dev,5,1,United States of America,70000,8400000.0,15
DEV33466,<35,Master,NonBinary,No,Dev,10,3,United Kingdom of Great Britain and Northern I...,75384,9046080.0,2

### 개발자별 고유 스킬다루기 데이터 
- 어떤 스킬을 공부해야 높은 월급을 받을 수 있는지 살펴보자!

In [29]:
skills = pd.read_csv("./data/Developer Skills.csv",encoding = 'euc-kr',index_col= '일련번호')
skills

                                                       보유기술
일련번호
DEV1                 C;C++;Java;Perl;Ruby;Git;Ruby on Rails
DEV2      Bash/Shell;HTML/CSS;JavaScript;PHP;Ruby;SQL;Gi...
DEV3      C++;HTML/CSS;Java;JavaScript;Kotlin;Node.js;Ty...
DEV4                                  Python;Git;PostgreSQL
DEV5                                  C;C++;Java;Python;Git
...                                                     ...
DEV33462                    C;C#;C++;Microsoft Azure;SQLite
DEV33463  C#;HTML/CSS;JavaScript;TypeScript;Docker;Kuber...
DEV33464  C#;HTML/CSS;Java;JavaScript;npm;ASP.NET Core ;...
DEV33465  C#;HTML/CSS;JavaScript;SQL;TypeScript;npm;Yarn...
DEV33466                                      Python;Docker

[33466 rows x 1 columns]

In [12]:
data

,나이,학력,성별,정신건강,전문직,개발공부기간,연차,국적,연봉,월급,보유기술개수
일련번호,,,,,,,,,,,
DEV1,<35,Master,Man,No,Dev,15,6,Germany,77290,9274800.0,7
DEV2,<35,Undergraduate,Man,No,Dev,9,6,Canada,46135,5536200.0,13
DEV3,>35,Master,Man,No,Dev,26,18,Germany,77831,9339720.0,17
DEV4,>35,Undergraduate,Man,No,Dev,39,21,United Kingdom of Great Britain and Northern I...,68507,8220840.0,3
DEV5,<35,Master,Man,No,Dev,19,10,Germany,60535,7264200.0,5
...,...,...,...,...,...,...,...,...,...,...,...
DEV33462,<35,Master,Man,Yes,Dev,7,5,United States of America,94000,11280000.0,5
DEV33463,<35,Undergraduate,Man,No,Dev,7,2,Germany,41058,4926960.0,13
DEV33464,>35,Undergraduate,Man,No,Dev,21,16,United States of America,115000,13800000.0,11
DEV33465,<35,Undergraduate,Man,Yes,Dev,5,1,United States of America,70000,8400000.0,15
DEV33466,<35,Master,NonBinary,No,Dev,10,3,United Kingdom of Great Britain and Northern I...,75384,9046080.0,2

In [30]:
skills

                                                       보유기술
일련번호
DEV1                 C;C++;Java;Perl;Ruby;Git;Ruby on Rails
DEV2      Bash/Shell;HTML/CSS;JavaScript;PHP;Ruby;SQL;Gi...
DEV3      C++;HTML/CSS;Java;JavaScript;Kotlin;Node.js;Ty...
DEV4                                  Python;Git;PostgreSQL
DEV5                                  C;C++;Java;Python;Git
...                                                     ...
DEV33462                    C;C#;C++;Microsoft Azure;SQLite
DEV33463  C#;HTML/CSS;JavaScript;TypeScript;Docker;Kuber...
DEV33464  C#;HTML/CSS;Java;JavaScript;npm;ASP.NET Core ;...
DEV33465  C#;HTML/CSS;JavaScript;SQL;TypeScript;npm;Yarn...
DEV33466                                      Python;Docker

[33466 rows x 1 columns]

In [19]:
skills.info()

<class 'pandas.core.frame.DataFrame'>
Index: 33466 entries, DEV1 to DEV33466
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   보유기술    33438 non-null  object
dtypes: object(1)
memory usage: 522.9+ KB

- 결측치 존재함!

In [32]:
skill_data = skills['보유기술'].str.split(";")

In [33]:
skill_data

일련번호
DEV1           [C, C++, Java, Perl, Ruby, Git, Ruby on Rails]
DEV2        [Bash/Shell, HTML/CSS, JavaScript, PHP, Ruby, ...
DEV3        [C++, HTML/CSS, Java, JavaScript, Kotlin, Node...
DEV4                                [Python, Git, PostgreSQL]
DEV5                              [C, C++, Java, Python, Git]
                                  ...
DEV33462                [C, C#, C++, Microsoft Azure, SQLite]
DEV33463    [C#, HTML/CSS, JavaScript, TypeScript, Docker,...
DEV33464    [C#, HTML/CSS, Java, JavaScript, npm, ASP.NET ...
DEV33465    [C#, HTML/CSS, JavaScript, SQL, TypeScript, np...
DEV33466                                     [Python, Docker]
Name: 보유기술, Length: 33466, dtype: object

- skill_data => 리스트 형태의 데이터가 삽입되어있음 -> 리스트 형태의 데이터를 다수의 행으로 증식시켜줌
```
explode()
```
- 리스트 안에 요소 개수만큼 행이 증식됨

In [35]:
explode_skill = skill_data.explode()
explode_skill.

일련번호
DEV1                           C
DEV1                         C++
DEV1                        Java
DEV1                        Perl
DEV1                        Ruby
                    ...
DEV33465                DynamoDB
DEV33465    Microsoft SQL Server
DEV33465                  SQLite
DEV33466                  Python
DEV33466                  Docker
Name: 보유기술, Length: 442784, dtype: object

In [44]:
pd.concat()

(442784,)

- 각 보유기술별 평균월급을 확인하고 싶음!

In [58]:
data['월급']

일련번호
DEV1         9274800.0
DEV2         5536200.0
DEV3         9339720.0
DEV4         8220840.0
DEV5         7264200.0
               ...
DEV33462    11280000.0
DEV33463     4926960.0
DEV33464    13800000.0
DEV33465     8400000.0
DEV33466     9046080.0
Name: 월급, Length: 33466, dtype: float64

In [57]:
explode_skill

일련번호
DEV1                           C
DEV1                         C++
DEV1                        Java
DEV1                        Perl
DEV1                        Ruby
                    ...
DEV33465                DynamoDB
DEV33465    Microsoft SQL Server
DEV33465                  SQLite
DEV33466                  Python
DEV33466                  Docker
Name: 보유기술, Length: 442784, dtype: object

In [61]:
full_data = pd.merge(explode_skill,data,how = 'inner',on ='일련번호') # on 인자를 통해 원하는 값을 기준으로 merge할 수 있음

In [62]:
full_data

,보유기술,나이,학력,성별,정신건강,전문직,개발공부기간,연차,국적,연봉,월급,보유기술개수
일련번호,,,,,,,,,,,,
DEV1,C,<35,Master,Man,No,Dev,15,6,Germany,77290,9274800.0,7
DEV1,C++,<35,Master,Man,No,Dev,15,6,Germany,77290,9274800.0,7
DEV1,Java,<35,Master,Man,No,Dev,15,6,Germany,77290,9274800.0,7
DEV1,Perl,<35,Master,Man,No,Dev,15,6,Germany,77290,9274800.0,7
DEV1,Ruby,<35,Master,Man,No,Dev,15,6,Germany,77290,9274800.0,7
...,...,...,...,...,...,...,...,...,...,...,...,...
DEV33465,DynamoDB,<35,Undergraduate,Man,Yes,Dev,5,1,United States of America,70000,8400000.0,15
DEV33465,Microsoft SQL Server,<35,Undergraduate,Man,Yes,Dev,5,1,United States of America,70000,8400000.0,15
DEV33465,SQLite,<35,Undergraduate,Man,Yes,Dev,5,1,United States of America,70000,8400000.0,15
DEV33466,Python,<35,Master,NonBinary,No,Dev,10,3,United Kingdom of Great Britain and Northern I...,75384,9046080.0,2
DEV33466,Docker,<35,Master,NonBinary,No,Dev,10,3,United Kingdom of Great Britain and Northern I...,75384,9046080.0,2

In [63]:
full_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 442784 entries, DEV1 to DEV33466
Data columns (total 12 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   보유기술    442756 non-null  object
 1   나이      442784 non-null  object
 2   학력      442784 non-null  object
 3   성별      442784 non-null  object
 4   정신건강    442784 non-null  object
 5   전문직     442784 non-null  object
 6   개발공부기간  442784 non-null  int64
 7   연차      442784 non-null  int64
 8   국적      442784 non-null  object
 9   연봉      442784 non-null  int64
 10  월급      442784 non-null  float64
 11  보유기술개수  442784 non-null  int64
dtypes: float64(1), int64(4), object(7)
memory usage: 43.9+ MB

In [67]:
full_data[full_data['보유기술'].isnull()]

,보유기술,나이,학력,성별,정신건강,전문직,개발공부기간,연차,국적,연봉,월급,보유기술개수
일련번호,,,,,,,,,,,,
DEV1257,NaN,>35,Other,Man,No,Dev,7,6,United States of America,85000,10200000.0,0
DEV1303,NaN,>35,PhD,Man,No,NotDev,37,0,Germany,76020,9122400.0,0
DEV3053,NaN,<35,Undergraduate,Man,No,Dev,8,4,India,70368,8444160.0,0
DEV3610,NaN,<35,Master,Man,No,Dev,11,3,United Kingdom of Great Britain and Northern I...,43686,5242320.0,0
DEV5301,NaN,<35,Master,Man,No,Dev,6,4,United States of America,82000,9840000.0,0
DEV5465,NaN,<35,Undergraduate,Woman,No,Dev,12,8,United States of America,145000,17400000.0,0
DEV5825,NaN,<35,Undergraduate,Man,No,Dev,3,2,India,10052,1206240.0,0
DEV7062,NaN,>35,Other,Man,No,Dev,35,30,United States of America,130000,15600000.0,0
DEV8183,NaN,>35,Other,Man,Yes,NotDev,33,18,United States of America,74089,8890680.0,0
DEV8616,NaN,<35,Undergraduate,Man,Yes,Dev,6,1,India,20940,2512800.0,0
DEV9363,NaN,<35,Master,Man,No,NotDev,8,0,Germany,25944,3113280.0,0
DEV10413,NaN,<35,Undergraduate,Man,No,Dev,8,4,Japan,107915,12949800.0,0
DEV11319,NaN,<35,Undergraduate,Man,Yes,Dev,15,11,United States of America,70000,8400000.0,0
DEV14627,NaN,<35,Undergraduate,Man,No,Dev,5,2,India,9773,1172760.0,0
DEV16579,NaN,<35,Undergraduate,Man,Yes,NotDev,16,14,United Kingdom of Great Britain and Northern I...,52996,6359520.0,0
DEV17764,NaN,<35,Undergraduate,Man,No,Dev,0,0,India,8377,1005240.0,0
DEV18083,NaN,<35,Undergraduate,Man,No,Dev,1,0,India,2508,300960.0,0
DEV18506,NaN,>35,NoHigherEd,NonBinary,No,NotDev,6,5,Japan,44965,5395800.0,0
DEV20549,NaN,<35,Undergraduate,Man,No,Dev,0,0,India,3864,463680.0,0
DEV22154,NaN,>35,Undergraduate,Man,No,NotDev,30,3,United Kingdom of Great Britain and Northern I...,26384,3166080.0,0
DEV22280,NaN,<35,Undergraduate,Man,Yes,NotDev,3,1,India,5412,649440.0,0
DEV25082,NaN,<35,Other,Man,No,Dev,8,2,India,3864,463680.0,0
DEV25217,NaN,<35,Undergraduate,Man,No,Dev,14,4,India,6960,835200.0,0
DEV25575,NaN,>35,Other,Man,Yes,NotDev,1,0,United Kingdom of Great Britain and Northern I...,47100,5652000.0,0
DEV26491,NaN,>35,Undergraduate,Man,No,NotDev,38,29,Canada,156168,18740160.0,0
DEV26897,NaN,>35,Other,Man,No,Dev,15,10,Canada,62467,7496040.0,0
DEV29584,NaN,>35,Other,Man,No,Dev,15,15,United States of America,95000,11400000.0,0
DEV32921,NaN,>35,Other,Man,No,NotDev,12,2,Germany,106644,12797280.0,0

- 보유기술 개수가 0개이므로 보유기술이 Nan

In [83]:
full_data['보유기술'].fillna('없음',inplace = True)

C:\Users\ChoiSeokjin\AppData\Local\Temp\ipykernel_14812\650345773.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  full_data['보유기술'].fillna('없음',inplace = True)

In [85]:
# 결측치 처리 완료
full_data[full_data['보유기술'].isnull()]

Empty DataFrame
Columns: [보유기술, 나이, 학력, 성별, 정신건강, 전문직, 개발공부기간, 연차, 국적, 연봉, 월급, 보유기술개수]
Index: []

### 보유기술과 연차에 따른 급여를 시각화 해보자!

In [90]:
full_data['보유기술'].unique()

array(['C', 'C++', 'Java', 'Perl', 'Ruby', 'Git', 'Ruby on Rails',
       'Bash/Shell', 'HTML/CSS', 'JavaScript', 'PHP', 'SQL', 'jQuery',
       'Laravel', 'AWS', 'MySQL', 'PostgreSQL', 'Kotlin', 'Node.js',
       'TypeScript', 'Docker', 'Kubernetes', 'Angular', 'Express',
       'Spring', 'Heroku', 'DynamoDB', 'Python', 'Assembly', 'Rust',
       'Ansible', 'Terraform', 'Yarn', 'React.js', 'SQLite', 'C#', 'VBA',
       'ASP.NET', 'Microsoft SQL Server', 'Gatsby', 'R', 'Flask',
       'ASP.NET Core ', 'Microsoft Azure', 'Elasticsearch', 'Julia',
       'Matlab', 'Google Cloud Platform', 'Clojure', 'Go', 'Angular.js',
       'MariaDB', 'MongoDB', 'Dart', 'PowerShell', 'Xamarin', 'Couchbase',
       'Redis', 'Vue.js', 'Chef', 'Unity 3D', 'Django', 'F#', 'Scala',
       'Unreal Engine', 'FastAPI', 'Firebase', 'DigitalOcean',
       'Objective-C', 'Swift', 'Symfony', 'IBM Cloud or Watson', 'Oracle',
       'Groovy', 'IBM DB2', 'Puppet', 'Cassandra', 'LISP', 'Delphi',
       'APL', 'Erlang', 'Elixir', 'Deno', 'Svelte', 'Haskell', 'Crystal',
       'Flow', 'Oracle Cloud Infrastructure', 'Drupal', 'Pulumi', '없음',
       'COBOL', 'npm', 'Homebrew', 'CouchDB', 'Neo4j', 'Google Cloud',
       'VMware', 'OpenStack', 'Next.js', 'Cloud Firestore',
       'Firebase Realtime Database', 'Nuxt.js', 'Blazor',
       'Managed Hosting', 'Fortran', 'Linode', 'Lua', 'OVH', 'SAS',
       'MATLAB', 'Play Framework', 'Phoenix', 'OCaml', 'Colocation',
       'Solidity', 'Fastify'], dtype=object)

In [91]:
full_data['보유기술'].value_counts()

보유기술
JavaScript        22431
HTML/CSS          18435
Docker            18017
SQL               17541
Git               16288
                  ...
APL                 108
Play Framework       92
SAS                  70
OCaml                47
없음                   28
Name: count, Length: 117, dtype: int64